//
//  ViewController.m
//  JKRFixiOS26CoreTextCrash
//
//  Created by 胡怀刈 on 2025/9/25.
//

#import "ViewController.h"
#import "JKRTextSafetyShared.h"

@interface ViewController ()<UITableViewDelegate, UITableViewDataSource>

@property (weak, nonatomic) IBOutlet UISwitch *isSafeCheckSwitch;

@property (weak, nonatomic) IBOutlet UITableView *tableView;

@property (nonatomic, strong) NSArray *showStrings;

@end

@implementation ViewController

- (void)viewDidLoad {
    [super viewDidLoad];
    
    self.tableView.delegate = self;
    self.tableView.dataSource = self;
    
    [self.tableView registerClass:[UITableViewCell class] forCellReuseIdentifier:@"Cell"];
}

- (NSInteger)tableView:(UITableView *)tableView numberOfRowsInSection:(NSInteger)section {
    return self.showStrings.count;
}

- (UITableViewCell *)tableView:(UITableView *)tableView cellForRowAtIndexPath:(NSIndexPath *)indexPath {
    UITableViewCell *cell = [tableView dequeueReusableCellWithIdentifier:@"Cell" forIndexPath:indexPath];
    
    NSString *showString = self.showStrings[indexPath.row];
    if (self.isSafeCheckSwitch.isOn) {
        JKRTextSanitizeStat st = {0};
        NSString *safeString = JKRSanitizePlainString(showString, &st);
        if (jkr_isSafe(st) == NO) {
            cell.textLabel.text = safeString;
        } else {
            cell.textLabel.text = showString;
        }
    } else {
        cell.textLabel.text = showString;
    }
    
    return cell;
}

- (IBAction)switchClick:(id)sender {
    [self.tableView reloadData];
}

- (NSArray *)showStrings {
    if (!_showStrings) {
        _showStrings = @[
            @"©️➦☠️&nbsp;‌▓‌▓‌⚜  ☠‌️🔯🔯🕉️🕉️🌹⃞⃟🌹⃞⃟🌹⃞⃟🌹⃞⃟🌹⃞⃟🌹⃞⃟🌹⃞⃟🌹⃞⃟🌹⃞⃟⃞⃟🌹⃞⃟🌹⃞⃟📴⃞⃟📴⃞⃟📴⃞⃟📴⃞⃟📴⃞⃟📴⃞⃟📴⃞⃟📴⃞⃞👨‍✈️⃞⃟👨‍✈️⃞⃟👨‍✈️⃞⃟👨‍✈️⃞⃟👨‍✈️⃞⃟👨‍✈️⃞⃟👨‍✈️⃞⃟⃞✑ۦ᳗⃛‌᳗⃛⃛⃛⃛⃛❍ۦ᳕⃛❍⃛‌⃛✑✅VIP✅;‌᳕᪺‌✑ۦ᪷᳗⃛⃛❍⃛‌⃛⃛‌ ;᳗⃛❍⃛‌⃛⃛‌ ;‌ۦ᪷‌᳗⃛⃛ۦ❍⃛‌⃛✑``᪺‌;‌᳕᪺‌✑ۦ᪷᳗⃛⃛C✅❍⃛‌⃛⃛‌;‌⃛⃛ۦ᪷᳗⃛⃛⃛ۦۦ᳕⃛‌⃛⃛ۦ᳕⃛❍‌᳗⃛✑``᪺‌@⃙᳕᪺‌✑ۦ᳗⃛‌᳗⃛⃛⃛⃛⃛❍ۦ᳕⃛❍⃛‌⃛✑ⁿ;‌᳕᪺‌✑ۦ᪷᳗⃛⃛❍⃛‌⃛⃛‌ ;᳗⃛❍⃛‌⃛⃛‌ ;‌ۦ᪷‌᳗⃛⃛ۦ᳕لٜٜٜٜٜٜٜٜٜٖٜٜٜٜٜٜٜᬼ‌ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٖᬼ‌ٜٜٜٜٜٜٜٜٜٖی کٜٜٜٜٜٜٜٜٖᬼ‌ٜٜٜٜٜٜٜٜٜٖٜٜٜٜٜٜٜٜٖᬼ‌ٜٜٜٜم✿‌߷ًًًًٍٍٍْْْٖٖٖٓٓٓٓ‌༅࿆༅‌لٜٜٜٜٜٜٜٜٜٖٜٜٜٜٜٜٜٜٖᬼ‌ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜ کٜٜٜٜٜٜٜᬼ‌ٜٜٜٜٜٜٜٜٜٖٜٜٜٜٜٜٜٜٖᬼ‌ٜٜٜٜٜٜٜ ߷ًًًًٍٍٍْْْٖٖٖ༎ྃالٜٜٜٜٜٜٜٜٜٖٜٜٜٜٜٜٜٜٖᬼ‌ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜF҉‌҉‌҉‌҉‌҉ B҉‌҉‌҉‌҉‌҉·҉˚҉™҉༘҉ᬼ‌ٜٜٜٜٜٜٜٜٜکٜٜٜٜٜٜٜᬼ‌ٜٜٜٜٜٜٜٜٜٖٜٜٜٜٜٜٜٜٖᬼ‌ٜٜٜٜٜVIP لام✿‌߷ًًًًٍٍٍْْْٖٖٖٓٓٓٓ‌༎ྃྂ༅‌الٜٜٜٜٜٜٜٜٜٖٜٜٜٜٜٜٜٜٖᬼ‌ٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٜٖᬼ‌ٜٜٜٜٜٜٜٜٜٖF҉‌҉‌҉‌҉‌҉ B҉‌҉‌҉‌҉‌҉·҉˚҉™҉༘҉ VIPکٜٜٜٜٜٜٜٜٖᬼ‌ٜٜٜٜٜٜٜٜٜٖٜٜٜٜٜٜٜٜٖᬼ‌ٜٜٜٜٜٜٜٜی💊⃞⃟💊⃞⃟💊⃞⃟💊⃞⃟💊⃞⃟💊⃞⃟💊⃞⃟💊⃞⃟💊⃞⃟💊⃞⃟A⃞⃟🔏⃞⃟🔏⃞⃟",
            @"🌹‎᭄ͥғᷢєͥяᷤ💍💘🎸",
            @"🔸꧁✟❦𓅇кคՇץ𓅇❦✟꧂",
            @"👑⃤⃟⃝𝓞𝓵𝓲𝓿𝓮𝓻",
            @"🔸👑⃝⃟💫ɖǟɦɨǟռǟ👑⃝⃟",
            @"Mayra Pantoja G",
            @"✨𝄞⃝🧸𝐂𝐞𝐬𝐚𝐫🍷",
            @"‎‎‎⏤꯭̽⭐⃪꯭🅴ᴍᴍᴀɴᴜᴇʟ",
            @"♰︎⁶⁶⁶ιναи☠‎‎₰​",
            @"𖤓⃝⍣⃟🐦‍🔥‎ᵐⁱˢᵗⁱᶜᵒ",
            @"‎‎❥֟፝͜͡͡💋Ꭺ𝐍Ꮆ₤Ꮮ❀",
            @"😈🍕🅜🅐🅡🅨🦋",
            @"𓆩‎ɪ፝֟ɴ☣B̶E̶B̶A̶🌺💸",
            @"(B)(o)(r)(i)(s)",
            @"『ཐི🅗ཋྀHinata💃🏻』",
            @"💎ღℂℝ𝕀𝕊𝕋𝕀𝔸ℕ",
            @"💍‎‎𝆺𝅥⃝🏳️‍charmosa",
            @"𝕯𝖆𝖒𝖆💍",
            @"🔱🕉ᎠᎫ Ꮶεѵเɳ Ⲙı✗🕉",
            @"🦋🪐᧒ꪊᩏỉᡶꫀꪹ ֶָ🦋་༘❤︎",
            @"𝓲żᾰ𝙽",
            @"†┋Gᥲtι֟tᥲ❥𓃢",
            @"‎‎☠️𝔧𝔞𝔠𝔨  ℜ𝔞𝔪",
            @"‎●⃝🔥Yᷫzͧaᷡaͩ🔥",
            @"『𝒫𝒾𝓀𝒶𝒸𝒽𝓊』",
            @"⚔️🅟🅘🅡🅐🅣🅐⚔️",
            @"‎🧿⊰‎ԳՄՏԵԹעԾ",
            @"‎〄ɪ⃢sɴᤨ‎‎ʍ૮ gu¡мê➢",
            @"‎ 𓄂Rᴏᷞᴅͥʀͦɪᷠɢᴏ",
            @"‎‎❥֟፝͜͡͡💋Alexส༻💖🖤",
            @"‎‎⍣⃝ᴬᴰᴹ𝚉𝚄𝙻𝚄ຖ.ค🌵",
            @"Pietro Kleim",
            @"🍉⃟᮪〭۬̇〬⃟   Kael♣ 🎩",
            @"‎✮⃟⃤🇨🇵 Ɗʝ🧉Қ10🎧",
            @"𓄂 ‎мͤαᷚуͥяᷮαͨ ͥ ͣ",
            @"‎‎ᶠᵐˡ≛⃝🦁 ‎‎ℳℐ𝒮𝒯ℰ",
            @"𝕭𝖆𝖓𝖉𝖎𝖉𝖔🥷",
            @"‎ s꙱֟፝⃞👑NykoKing💍",
            @"𝓐𝓷𝓭𝓻𝓮👳🏼",
            @"🔥👑Aͫpͣoͧlito 🦁🔥",
            @"m͛o͛r͛e͛n͛a͛",
            @"ᴀʀʟᴇͨQͣᴜᷤɪͭɴᷞᴀͤ",
            @"‎●⃝👑ᴍᴀʀͧʀᷡᴇͥɴͨᴛͦᴏ👑",
            @"⫹💍⚓ᴛʀᴀᴜᴍᴀᴛɪᴢᴀᴅᴀ⚓⫺💸",
            @"ⱼᷟ𝄟⃟💍ᗪꫀꪊᦓꪖ💎♡🔥",
            @"🧿⊰🦋ꜱʜɪɴᴏʙᴜ ᴋᴏᴄʜŌ🦋",
            @"♛‎⁵⁰³flakitaɆⱠ₱ⱠɆ฿Ɇ",
            @"‎♛ε𝐋Ｚℴ𝙧𝖗ℴ⁵⁰³",
            @"❥֟፝͜͡͡💋𝙰𝚗𝚒𝚝𝚊🫰",
            @"🥃🍂✿☆мαяℓυиα☆✿🍂☕",
            @"★ᴾᴿᴼཌĐʀᴀɢᴏƝདﾌㄩ卂几༒ᴅяᴋ",
            @"💀♤ABADóN👹💀",
            @"✯͜͡🇧🇷ƞαͣιᷠяᷯσͣβﴶ᭢",
            @"‎⍣⃝ᴸᴰᴿ𝕄𝕒𝕣𝕪 ຖ.ค🌵",
            @"🖤⃟⃘⃤🅸🆂🅰ᴴᵒˡˡʸ🐢",
            @"●⃝🔥Douglas🔥💍",
            @"₴ØɎ  ⱧłJ₳ Đ ₴ɆⱤ₲łØ🍷",
            @"『Íиdiα ᥫ᭡𝓢』",
            @"🧁𝗦𝗮𝗶𝗺𝘆🌸",
            @"❦︎𝓙𝓸𝓷𝓪𝓣𝓱𝓪𝓷❦︎",
            @"ⱼᷟ𝄟⃟ 💍VINGADORA",
            @"EŁ ₡λBλŁŁEŘØ BŁλ₡K",
            @"Lₐ ᵥᵢₗₗₐₙₐ 𓀏ᥫ᭡🐾",
            @"≛⃝☙𝖈𝖑𝖆𝖚𝖉𝖎𝖆",
            @"‎༆🅐⃟🅥👸💍ᒍᑌᗩᑎ🏍࿐",
            @"👑 ⃝⃟PØĐ€ŘØŞØ",
            @"🌻👒Ely🪭🌻",
            @"‎‎●⃝Olivia💕",
            @"‎❥𝒋𝒖𝒍𝒍𝒚🍀🍀🍀",
            @"★᭄ℓąяɨֆa 01",
            @"☆☬ᏕᏋᏒᎶᎥᎧ✞☬ঔৣ꧂",
            @"💍🅜𝐚𝐥𝐯𝐚𝐝𝐢𝐧𝐡",
            @"‎➷⍣⃝‎‎‎💍νєηͩєͦηͨσͤ࿐",
            @"‎🅰️♈🅰️✝️🅰️☄",
            @"‎‎🎼⍣⃝🌺𝐋𝐚𝐲𝐬𝐚🦋",
            @"👑 ͜͡ ⋆𝖒𝖆𝖌𝖌𝖎🍊",
            @"‎‎❥֟፝͜͡͡💋Rebeca🌴",
            @"‎🌹‎᭄ιᷫяꭵꙴѕᷢ💍💘👑",
            @"☠️🌜♓⛎🅿ó🎵🍼🍺💊💉",
            @"‎‎‎❥֟፝͜͡͡💋Cคmΐℓค",
            @"❥֟፝͜͡͡💋Jᴵˢღᴰ'ᴬᵈᵉʳᵐⁱ",
            @"🖤𝓐𝓮𝓲𝓸𝓾🖤⁵⁰³",
            @"‎🇸 🇭 🇪 🇮 🇰",
            @"‎👑 ͜͡ ⋆‎𝓛𝓸𝓫𝓸",
            @"‎‎ ⁴₂⁰ ࿐⃟꙰₵₳Ɽ₥Ɇ₦ Ɏ₳Đ",
            @"‎👑 🦁ႦαႦყԃισʂα",
            @"‎‎🏰⃤꙰🤴💍ᴾᵃᵗʳíᶜⁱᵃ ❤",
            @"👿💸⍣⃝‎🦅༒Bellabeth",
            @"😮‍💨 ᴾᴿᴵᴺᶜᴱˢᴬ🫦",
            @"‎‎❥֟፝͜͡͡💋ρɾεƭเɳɦσ",
            @"♡𝔊𝔩𝔢𝔫𝔡𝔞♡ ❤️L❤️",
            @"ॐ_x000d_rͭaͤyͫmⷬuⷦnͧdⷭoͥॐ",
            @"『❥‌֟ɢͩʀⷷɪͧɴᷤɢⷶᴀᥫ᭡』",
            @"‎『✿︎𝗝𝘂𝗷𝘂֟፝𝗯𝗮✰』",
            @"💍ꪻ͢Μσяͩεͦηᷡιͣηн͢α𝆺𝅥",
            @"🚓👮 mauricio zubia",
            @"Baba voz",
            @"🥷‎‎⩔Ɨ₱⁴²⁰₳ⱠƗ$$Ø₦",
            @"✧⃝💎🍑👻🌵Ⓝⓐⓣⓐⓢⓗⓐ 🛴",
            @"🐺 ⃝⚚Pαŧy🔸",
            @"🪄Eclïpsë💞",
            @"☆* ✿⚓ ᘻᗩᖇᓰᖴᘿᖇ ♔☆* ✿｡",
            @"🍺🎧 Goku",
            @"🧨꙰🅻🅾🅾🅸🆁🅰𑜞᭄",
            @"⍣⃝👑Tony Stark ❤️⃟⃟p",
            @"❥֟፝͜͡͡💋 ᴷᵞᴿᴬ💫☯️",
            @"❥𝄞⍣⃝𝕬ntonyella",
            @"⃝⃞➳🌸Bᴜɢᴀͣᴅͩᴀͫ🌸",
            @"⍣⃟Wɪͧᴢᷡᴀͥʀͨᴅͦ✨",
            @"ˢʳᵗᵃ𝖘𝖆𝖓𝖙𝖆𝖓𝖆🎀",
            @"‎🌠𝓥σʋᴏ́Đєиαᴾᵒᵇʳᵉ",
            @"😈~♥~٩𝔸𝔫ăᎥŝ۶~♥~",
            @"‎✿્᭄͜͡𝙏𝙀𝙄𝙈𝙊𝙎𝘼",
            @"♥️💍WƎ˥INᗡ∀ 🩸",
            @"Pąɲďɨɲhą🐼",
            @"$ITACHI@",
            @"‎🧬‎‎Criminoso🤬🤬",
            @":꧁ ⃟≛⃝⃝💯%🐝",
            @"꧁ ⃟≛⃝⃝💯%🤴",
            @"⏤͟͞❥‌֟፝Débs✿꯭⃭👑",
            @"‎𝑻𝑾𝑰𝑿ﮮ'",
            @"͟͟͞💗𝆺𝅥⃝🧚𝔏𝔲𝔞𝔫𝔞",
            @"‎‎༆🅐⃟🅥👸Rosa࿐",
            @"☻⃟ρᷡяͣєͬтͬιͣиͩнͦσ",
            @"Ingred❥⃝🔐",
            @"KYO",
            @"🎲𝆺𝅥⃝JuS𝔲𝔭𝔯𝔢𝔪𝔞",
            @"ꪻ͢🍻🆇🆃🆁🅴🅼🅾",
            @"☠️⚔️🖤 ʂꀤɳ🖤🛡️👿",
            @"👑 ͜͡ ⋆𝓔𝓼𝓶𝓮✨️",
            @"🍒🫶CꂅᏒꂅᏃᎥϮᕱ🎀🍒",
            @"💍❣︎ℍ𝕖𝕝𝕝𝕖𝕟𝕒",
            @"꧁ᬊ🎧𓃠D𝐉 𝕽𝟕ꪻᦔ愛ᬊᬁ꧂",
            @"🦋 𝙈AYLLA 💍ALONSO",
            @"ℱ⃟⃟⃟🏰⃟⃝AnaClara💍",
            @"ᴍᷤᴀᷡʀᷳʀᷱᴇɴᴛᴀ࿐",
            @"🧿⊰‎🍁ᴮᴮ ᵏᵃᵗᵃˡᵉʸᵃ🐇",
            @"‎ 🖤⃝🦋𓍯iriss⌱⃟🍷",
            @"‎‎‎‎︎❥𝄞⃝☣𝕮𝖆𝖒i🎀",
            @"🇧🇷ɴᷤᴀᷡsᷳᴄᷱɪᴍᴇɴᴛᴏ࿐♊",
            @"ℱ⃟⃟⃟🏰⃟⃝⃟ℜNicole𓂀",
            @"『𝓪̊Ƚ£×𝓪̊』",
            @"✟𝓛𝖎𝖑 𝓟𝖍𝖎𝖑𝖎✟",
            @"Daniel",
            @"🎲𝆺𝅥⃝𝐉ᥙᥒiᥒh᥆",
            @"⁴₂⁰‎‎คłꪜคяεɀ‎⚕️",
            @"👿💸💙 ༆𝓨𝓔𝓛𝓨✯💙",
            @"🐆⃟⃝🔒ℋ𝒜𝒟𝒜𝒮𝒮𝒜ℋ",
            @"⫷💞ғᵛ⃢ᵗ🌍𓄂𝓐𝓷𝔂𓃇",
            @"🂱Bell👑🦖",
            @"‎☪‎‎‎Beck",
            @"⚔️👑ELREYVENGADOR👑⚔",
            @"‎༒ˢʳᵗᵃ‎SALOME☬",
            @"‎‎‎‎❥֟፝͜͡͡💋ᏆᏙᎪΝΝᎪ🧸",
            @"꧁ঔৣѦℓϵxᴀ̊́ꪀᗫʀαঔৣ꧂",
            @"✭(*𝓑𝓮𝓼𝓲𝓽𝓸🕷✭",
            @"🍑⃝⁷⁷⁷Ø₴V₳ⱠĐØ ❝😈",
            @"💍𝕮𝖎𝖇𝖊𝖑𝖑𝖞ꨄ",
            @"𝄞⋆⃝❤️ sirenita ❤",
            @"💫✨💫A💫N💫G💫E💫L💫",
            @"༊⃝💍ѕєͩяͦєͨиͤᴀ🦋࿐",
            @"ᵈᵘᵈᵃ😡😡😡😡😡😡😡😡",
            @"ꨄꪜᴀᴍͫᴘͥɪᷡʀͥɪɴʜᴏ ঔ",
            @"⛈֟፝͜͡☭🇦🇸ᏒᏬᎥᏉᏗ💍🐢",
            @"💍‎⋆᭄᳭͢🌹 Erick",
            @"‎〄ɪ⃢sɴᤨAℓℓลи☠🎲‎ ➢",
            @"💍𓅛Bͬʟͤᴀᷤᴄͤᴋͭ",
            @"‎‎⏤꯭̽⭐⃪꯭𝐒αɾαнι",
            @"‎꧁Lúcifer꧁",
            @"🔥⃝ॐᵈⁿ𝑳𝑲💸",
            @"‎➷⍣⃝‎🍻‎⁴.²⁰༄˖°.🍂",
            @"Ⓥ❟❛❟㊧Akaza✇め初",
            @"●⃝🔥💍ʙᴇ̂ᴇʜ🔥",
            @"⍣⃝🐺令ℜ么•从么ℜℜ玄ᜰ亇么",
            @"🐯⃝ᜰ玄᮱O",
            @"(◣_◢)Cꁝ꒐ꉔꋬ Mꋬ꒒(◣_◢)",
            @"꧁ ⃟≛⃝⃝💯%🐝👸",
            @"😈💸🍀ᷢ🍒ⷣαsԵɾí́ժ🔱",
            @"‎iͬmͤpͣeᷞraᷴtᷡrͥiͨzͣ",
            @"ᴹᴬᴿᴵᴬᴺᴬ🐥❤️",
            @"💍ᴠᷤɪᷡᴄᷳᴋᷱ࿐❤",
            @"‎‎‎‎‎🅰️‎‎🆁‎,,wow",
            @"ꪖꪶꫀ𝓳ꪖꪀᦔ𝘳ꪮ",
            @"🎲𝆺𝅥⃝🅜🅐🅖🅝🅐🅣",
            @"🍑❼❼❼🍃🦩 Ⲙ₳ɌƗ₳₦₳ 👻",
            @"♥︎⃟𝄞ɢᴜ̂នᴰ'Ꮢᵘᵗʰ",
            @"🇲🇽♟️ PANTER♟️🇲🇽",
            @"👑🦁Lûįs😏🤤",
            @"‎‎❥֟፝͜͡͡💋👻fⱥղτⱥຮϻส",
            @"𝓛𝓘𝓢𝓑𝓔𝓣𝓗",
            @"🤍💍ℙ𝕒𝕦𝕝𝕠 🖤",
            @"✨️𝄞⃝💋ʋɨʟʟɛɢǟs🧸",
            @"JefaEventos",
            @"➳͢≛⃝🌸Ðєυѕα🌸࿐",
            @"🐍🦦ρ𝐑𝐢𝓃¢𝐄𝐬𝕤🖤",
            @"lobo‎❥֟፝͜͡͡💋",
            @"🍒⃔ᵴ⃝🎀ꪶꪖ ꪻ᥅ꫀꪑꫀꪀ🥑🥷",
            @"⁴₂⁰ ✨ꙷуαяє💓",
            @"🌟💫EsԵɾҽllα💫🌟",
            @"『🧚𝓐𝓻𝓲𝓮𝓵𝓮🧚』",
            @"💋ᥫ᭡⃟๓ɨᵏєվℓa🫧",
            @"ቾ์™ Ŧurcoღ",
            @"ꦿ ঔৣ꧂ⒿⒶⒼⓊⒶⓇ",
            @"ⱼᷟ𝄟⃟Betânia 🔥",
            @"👑✨ˢʳᵃEstrella✨👑🦋",
            @"‎ ❥⃝⃝⃝⃝♛ᗪ乇乃ㄖ匚*卂ᗪ卂ꨄ",
            @"³⁰☄ꪶ𓃺☁Р𝕣ḯⁿcɇ☁✨",
            @"⚘𝙆𝙖𝙩𝙞𝙖⚘",
            @"●⃝🔥Rafael 🔥",
            @"🕷️🕸️❤️💋 fujitivo",
            @"𓆩🎮𓆪Tėssa💅🏻",
            @"♧፝֟͜🤡ρεͧરᷡαͥʅͨƚͦα♧",
            @"ᬊᬁᴅᵇ⃟LARA",
            @"👑•🦁Ṃąᶰ𝔤บ𝗶ţ𝚘•",
            @"‎‎💍Nå* čhº",
            @"bąblø",
            @"💍ꨄρєяιɢσѕσꨄ🔥",
            @"‎‎𓄂‎🦂ⱤɆł₦₳",
            @"❥֟፝͜͡͡💋yaquita 🥰😍",
            @"‎⍣⃟⍣⃝‎🥃ϻϵͧnᷡiͥnͨoͦ",
            @"🤴ᴍᴇɴɪɴᴏ ʀᴇɪ👑",
            @"ᏴᎡ🇧🇷𝙰𝚕𝚊𝚗 ʂɬ",
            @"✮⃝ 🧁Dᴏͧᴄᷡɪͥɴⷭʜͦᴏ",
            @"『Wiʆʆ』",
            @"💫J⋆U⋆L⋆I⋆💫",
            @"ⱼᷟ𝄟⃟DJ🎧ℳ𝒶𝓇𝒸ℯ𝓁ℴ",
            @"❦🏹🍬✿✦λᏓλᎥλ✦✿🦋🌸",
            @"❟❛❟𝙸𝚝𝚊𝚌𝚑𝚒㊧✇",
            @"🇨🇴𝒶𝓁𝑒𝒿𝒶𝓃𝒹я◇",
            @"‎‎🂱ˢʳᵗᵃϻⲁᴙᴉ🦋꙰☪︎🪽",
            @"‎➤⃝✫𝖒𝖊𝖌𝖆𝖓 ⍣⃝‎‎✫",
        ];
    }
    return _showStrings;
}




@end
